run/burro9/burro9Atm/0.orig/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontField
    {
        type            fixedValue;
        value           uniform 0;
    }
    backField
    {
        type            zeroGradient;
    }
    symPlane
    {
        type            symmetryPlane;
    }
    sideField
    {
        type            zeroGradient;
    }
    ground
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
